{"providerId": "prov_1", "userId": "cust_3", "rating": 5, "comment": "Fantastic service! Fixed my overheating engine quickly and explained everything clearly. Very professional."}
{"providerId": "prov_2", "userId": "cust_5", "rating": 4, "comment": "Sorted out my gearbox grinding issue. Took a bit longer than expected but the result was great. Fair price too."}
{"providerId": "prov_3", "userId": "cust_2", "rating": 5, "comment": "BrakeMaster were brilliant. Replaced all four pads and bled the brakes. Car stops perfectly now. Highly recommend."}
{"providerId": "prov_4", "userId": "cust_1", "rating": 4, "comment": "Good garage, diagnosed my electrical fault within the hour. Could improve on communication but work quality was solid."}
{"providerId": "prov_5", "userId": "cust_6", "rating": 5, "comment": "Quick and easy slow puncture repair. Done in 20 minutes while I waited. Great value and friendly staff."}
{"providerId": "prov_6", "userId": "cust_17", "rating": 3, "comment": "Got the job done with the brake pads but reception was a bit unhelpful and I had to chase for updates."}
{"providerId": "prov_7", "userId": "cust_10", "rating": 5, "comment": "West London AC were incredible. Fixed my heating matrix the same day. Car is warm and cozy again. Can't fault them."}
{"providerId": "prov_9", "userId": "cust_15", "rating": 4, "comment": "Battery replaced and charging system checked thoroughly. Good technical knowledge and honest pricing."}
{"providerId": "prov_12", "userId": "cust_27", "rating": 5, "comment": "Islington Engine & Transmission identified the cold-start knock as a worn timing chain. Fixed it properly. Excellent work."}
{"providerId": "prov_14", "userId": "cust_12", "rating": 4, "comment": "New tyres fitted promptly. They also flagged a wheel alignment issue I wasn't aware of. Very thorough inspection."}
{"providerId": "prov_15", "userId": "cust_8", "rating": 4, "comment": "Camden Electrical ran a full diagnostic scan and cleared the fault. Very knowledgeable team and reasonable rates."}
{"providerId": "prov_16", "userId": "cust_26", "rating": 5, "comment": "Absolutely stunning respray job. You'd never know the car had been keyed. Paint match was perfect."}
{"providerId": "prov_17", "userId": "cust_13", "rating": 4, "comment": "Automatic transmission service sorted the slipping completely. Clear explanation of what was done. Will return."}
{"providerId": "prov_18", "userId": "cust_28", "rating": 3, "comment": "ABS sensor replaced but I had to wait two days for the part. Workshop could be better organised."}
{"providerId": "prov_19", "userId": "cust_23", "rating": 5, "comment": "Lewisham Climate diagnosed a loose compressor bracket rattling against the AC housing. Fixed quickly and cheaply!"}
{"providerId": "prov_20", "userId": "cust_9", "rating": 5, "comment": "Hammersmith Brake replaced a seized caliper and both front pads. Braking is now perfectly straight and smooth."}
{"providerId": "prov_24", "userId": "cust_22", "rating": 4, "comment": "Croydon Comprehensive cleaned the fuel injectors and replaced the MAF sensor. Acceleration is sharp again."}
{"providerId": "prov_25", "userId": "cust_19", "rating": 4, "comment": "Window motor replaced in both front doors. Had to leave car overnight but result was great. Recommend for electrics."}
{"providerId": "prov_26", "userId": "cust_20", "rating": 5, "comment": "Sorted the blowout damage, fitted two new tyres and ran a full alignment check. Very professional and efficient."}
{"providerId": "prov_28", "userId": "cust_16", "rating": 5, "comment": "Finchley Prestige sent a technician to my roadside location within 40 minutes. Oil pump replaced. Literally saved my engine."}
{"providerId": "prov_3", "userId": "cust_9", "rating": 4, "comment": "Used BrakeMaster on a second visit for rear brakes. Consistent quality and honest assessment every time."}
{"providerId": "prov_1", "userId": "cust_11", "rating": 3, "comment": "Engine misfire eventually fixed after two visits. First diagnosis was incorrect but they didn't charge for the return trip."}
{"providerId": "prov_7", "userId": "cust_4", "rating": 5, "comment": "West London AC recharged the refrigerant and replaced a faulty expansion valve. AC is ice cold now. Perfect service."}
{"providerId": "prov_5", "userId": "cust_24", "rating": 5, "comment": "Mobile tyre team arrived within 35 minutes to fix my flat on the roadside. Absolute lifesavers. Will always use them."}
{"providerId": "prov_2", "userId": "cust_21", "rating": 4, "comment": "Clutch replacement was done in a day. Smooth engagement now and a fair price given the labour involved."}
{"providerId": "prov_13", "userId": "cust_15", "rating": 4, "comment": "Paddington Road Recovery towed my car without any fuss. Arrived on time and handled the car with care."}
{"providerId": "prov_10", "userId": "cust_5", "rating": 5, "comment": "Greenwich Full Service completed a full service and MOT prep. Identified worn tyres and a leaking coolant hose before they became problems."}
{"providerId": "prov_22", "userId": "cust_7", "rating": 4, "comment": "Vauxhall AC & Bodywork repaired the door dent and touched up the paint. Very tidy finish and good value."}
{"providerId": "prov_29", "userId": "cust_18", "rating": 3, "comment": "Windscreen replacement was fine but scheduling was frustrating. Took three days to get an appointment."}
{"providerId": "prov_30", "userId": "cust_30", "rating": 4, "comment": "Ilford Multi-Service replaced both rear door actuators. Works perfectly now. Friendly and knowledgeable staff."}
